Revit 2024 API
RevolvedSurface.Create Method
Overload List
Name | Description
Create(Frame, Curve)
 Creates a Surface object coincident with the surface of revolution defined by a coordinate frame and a profile curve.
Create(XYZ, XYZ, Curve)
 Creates a Surface object coincident with the surface of revolution defined by an axis and a profile curve.
Create(Frame, Curve, Double, Double)
 Creates a Surface object coincident with the surface of revolution defined by a coordinate frame, a profile curve, and start and end angles of revolution.
Create(XYZ, XYZ, Curve, Double, Double)
 Creates a Surface object coincident with the surface of revolution defined by an axis, a profile curve, and start and end angles of revolution.
See Also
RevolvedSurface Class
RevolvedSurface Members
Autodesk.Revit.DB Namespace